Repository: ystk/debian-samba
Catalog: debian/po/*.po
Languages: eu, hu, ku, lt, tr, zh_tw

source: Samba server and utilities
tr: Samba sunucusu ve yardımcı uygulamaları

source: Modify smb.conf to use WINS settings from DHCP?
eu: smb.conf WINS ezarpenak DHCP-tik jasotzeko eraldatu?
hu: Módosítod az smb.conf-ot, hogy a WINS beállításokat a DHCP-n keresztül érje el?
ku: Bila smb.conf were guherandin da ku mîhengên WINS ji DHCP werin bikaranîn?
lt: Pakeisti smb.conf, kad būtų naudojami WINS nustatymai iš DHCP?
tr: smb.conf dosyası WINS ayarlarını DHCP sunucusundan alacak şekilde değiştirilsin mi?
zh_tw: 是否要修改 smb.conf 以使用來自 DHCP 的 WINS 設定？

source: If your computer gets IP address information from a DHCP server on the network, the DHCP server may also provide information about WINS servers ("NetBIOS name servers") present on the network. This requires a change to your smb.conf file so that DHCP-provided WINS settings will automatically be read from /etc/samba/dhcp.conf.
eu: Zure sistemak IP helbidea sareko DHCP zerbitzari batetatik jasoaz gero, zerbitzari horrek sareko WINS ("NetBIOS name servers") zerbitzarien datuak eman ditzake. Honek smb.conf fitxategian aldaketa bat behar du DHCP bidezko WINS ezarpenak /etc/samba/dhcp.conf-etik irakurtzeko.
hu: Ha e gép az IP címeket egy DHCP kiszolgálótól kérdezi le a hálózaton, lehet, hogy a WINS kiszolgálók ("NetBIOS névkiszolgálók") listáját is le tudja kérdezni. Ehhez az smb.conf módosítása szükséges, hogy a DHCP-n keresztüli WINS beállításokat automatikusan kiolvassa a /etc/samba/dhcp.conf-ból.
ku: Eger kompîtera te ji ser pêşkêşkarê ji DHCPê navnîşaneke IPê bistîne, dibe ku pêşkêşkara DHCP jî derbarê pêşkêşkara WINSê de agahiyan peyda bike ("NetBIOS navê pêşkêşkaran) ji ser torê pêşkêş bike. Ji bo vê divê pelê te yê smb.conf bê guherandin lewre mîhengên WINSê yên DHCP-pêşkêş dike ji /etc/samba/dhcp/confê xweber bên xwendin.
lt: Jei šis kompiuteris gauna IP adresus iš tinklo DHCP serverio, DHCP serveris taip pat gali teikti informaciją apie tinklo WINS serverius (NetBIOS vardų serverius). Kad WINS nustatymai, gauti per DHCP (saugomi rinkmenoje /etc/samba/dhcp.conf), būtų naudojami, reikia pakeisti rinkmeną smb.conf.
tr: Eğer bilgisayarınız IP adresini ağınızdaki bir DHCP sunucusundan alıyorsa, DHCP sunucusu ayrıca ağınızda bulunan WINS sunucuları ("NetBIOS alanadı sunucuları") hakkında da bilgi verebilir. Bu özellikten yararlanmak, smb.conf dosyanızda DHCP tarafından sunulan WINS ayarlarının kendiliğinden /etc/samba/dhcp.conf dosyasından okunmasını sağlayacak bir değişikliği gerektirir.
zh_tw: 如果您的電腦是從網路上的 DHCP 伺服器取得 IP 位址之資訊的話，這個 DHCP 伺服器可能也提供了網路上的 WINS 伺服器（NetBIOS 名稱服務）的資訊。這需要修改您的 smb.conf，讓 DHCP 所提供的 WINS 設定可自動於 /etc/samba/dhcp.conf 中取得。

source: The dhcp3-client package must be installed to take advantage of this feature.
eu: Ezaugarri honetaz baliatzeko dhcp3-client bezeroa instalaturik izan behar duzu.
hu: A dhcp3-client csomagnak telepítve kell lennie e képesség kihasználásához.
ku: Ji bo bikaranîna vê fonksiyonê divê pakêta dhcp3-client were sazkirin.
lt: Kad būtų galima pasinaudoti šia galimybe, turi būti įdiegtas paketas dhcp3-client.
tr: Bu özellikten yararlanabilmek için dhcp3-client paketinin de kurulmuş olması gerekir.
zh_tw: 必須安裝了 dhcp3-client 套件，才能受益於這個功能。

source: Configure smb.conf automatically?
eu: Smb.conf automatikoki konfiguratu?
hu: Az smb.conf-ot automatikusan állítod be?
ku: Bila smb.conf were jixweber mîhengkirin?
lt: Automatiškai konfigūruoti smb.conf?
tr: smb.conf dosyası kendiliğinden yapılandırılsın mı?
zh_tw: 是否要自動設定 smb.conf？

source: The rest of the configuration of Samba deals with questions that affect parameters in /etc/samba/smb.conf, which is the file used to configure the Samba programs (nmbd and smbd). Your current smb.conf contains an "include" line or an option that spans multiple lines, which could confuse the automated configuration process and require you to edit your smb.conf by hand to get it working again.
eu: Konfigurazioaren hurrengo atalak /etc/samba/smb.conf fitxategiari dagozkion ezarpenenak dira, honek Samba programak (smbd eta nmbd) konfiguratzen ditu. Zure smb.conf fitxategiak 'include' lerro bat edo lerro bat baino luzeago den aukera bat badu, horregatik konfigurazio automatiko fitxategia honda daiteke, zuk eskuz konpondu beharko duzularik.
hu: A Samba további beállításaihoz a /etc/samba/smb.conf paramétereit befolyásoló további kérdéseket kell megválaszolni, ami a Samba programok (nmbd és smbd) beállítófájlja. A jelenlegi smb.conf tartalmaz egy 'include' sort, vagy egy több sorra tört opciót, ami megzavarhatja az automata beállító folyamot, és szükségessé teszi az smb.conf saját kezű szerkesztését, hogy az ismét működjön.
ku: Tevahiya vesazkirina peymana Sambayê ya bi pirsan bandorê li parametreya /etc/samba/smb.confê dikin yên bernameyên Sambayê (nmbd û smbd) vesaz kirine. Di smb.confa te ya niha de rêzikeke "include" an jî zêdetir rêzik, yên ku dikarin pêvajoya vesazkirina xweber têk bibin û hewcetî derxin ku tu smb.confê bi destan saz bikî da ku bixebite.
lt: Likusi Samba konfigūravimo dalis susijusi su parametrais, nustatomais Samba konfigūracijos rinkmenoje -- /etc/samba/smb.conf. Ši rinkmena konfigūruoja Samba programas (nmbd ir smbd). Esamame smb.conf yra „include“ komanda arba nustatymas, užrašytas per kelias eilutes. Tai gali sutrikdyti automatinį konfigūravimo procesą, todėl gali prireikti rankiniu būdu paredaguoti smb.conf, kad Samba vėl pradėtų veikti.
tr: Geri kalan Samba yapılandırması, Samba uygulamalarını (nmbd ve smbd) yapılandırmak için kullanılan /etc/samba/smb.conf dosyasındaki parametreleri etkileyen sorularla sürecektir. Varolan smb.conf dosyası, kendiliğinden yapılandırma sürecini şaşırtabilecek bir "include" satırı ya da birden fazla satıra yayılan bir seçenek içerdiğinden Samba'nın yeniden çalışabilmesi için bu dosyanın elle düzenlenmesi gerekebilir.
zh_tw: 剩下的 Sabma 設定將處理那些會影響到 /etc/samba/smb.conf 中的參數的問題。這個檔案是用來設定 Sabma 程式（nmbd 和 smbd）。但您目前的 smb.conf 裡中包含了一行 "include"，或是有某個選項跨越多行，這將會攪亂自動設定程序，使得您必須手動修復 smb.conf 才能讓它正常運作。

source: If you do not choose this option, you will have to handle any configuration changes yourself, and will not be able to take advantage of periodic configuration enhancements.
eu: Aukera hau ez erabiliaz gero, konfigurazioko edozein aldaketa eskuz egin beharko duzu eta ezingo duzu konfigurazio aldaketa automatikoez baliatu.
hu: Ha nem élsz e lehetőséggel, minden beállítás változását neked kell felügyelned, és nem élvezheted az időszakos beállításhangolás előnyeit.
ku: Eger tu vê vebijêrkê hilnebijêrî, dê pêwîst bibe ku tu hemû veaszkirinan bi serê xwe pêk bînî, û dê avantaja pêşdeçûna vesazkirina periyodîk pêk neyê.
lt: Jei nepasirinksite šios galimybės, turėsite konfigūruoti Samba rankiniu būdu ir negalėsite pasinaudoti reguliariais automatiniais konfigūracijos patobulinimais.
tr: Eğer bu seçeneği seçmezseniz, bütün yapılandırma değişikliklerini kendiniz yapmak zorunda kalacak ve periyodik yapılandırma iyileştirmelerinin avantajlarını kullanamayacaksınız.
zh_tw: 如果您不選取這個選項，您就必須自行處理所有的設定上的改變，同時也將無法受益於定期的設定改進所帶來的好處。

source: Workgroup/Domain Name:
eu: Lan Talde/Domeinu izena:
hu: Munkacsoport/Tartomány neve:
ku: Navê Koma Xebatê/Domain:
lt: Grupė (workgroup) / domeno vardas:
tr: Çalışma Grubu / Etki Alanı Adı:
zh_tw: 群組/網域：

source: Please specify the workgroup for this system. This setting controls which workgroup the system will appear in when used as a server, the default workgroup to be used when browsing with various frontends, and the domain name used with the "security=domain" setting.
eu: Mesedez zehaztu sistema honetarako lan-taldea. Ezarpen honek sistema zerbitzari moduan erabiltzean agertuko den lan-taldea, zenbait interfaze bidez bistaratzean erabiliko den lehenetsitako lan-taldea eta "security=domain" ezarpenak erabiltzen duen domeinu izena kontrolatzen ditu.
ku: Tika ye Koma Xebatê ya vê pergalê diyar bike. Ev mîheng kontrol dike ka dê di bikaranîna pêşkêşkarekê de kîjan Koma Xebatê bê nîşandan, Koma Xebatê ya heyî ya dem bi dem fronted tê gerîn û navê domaînê ya bi mîhenga "security=domain"ê tê bikaranîn.
tr: Lütfen bu sistem için bir çalışma grubu (workgroup) belirtin. Bu ayar sistemin sunucu olarak kullanıldığı durumda hangi çalışma grubunda gözükeceğini belirleyeceği gibi, ağda yapılacak göz atmalarda öntanımlı çalışma grubu olacak ve ayrıca "security=domain" ayarında alan adı olarak kullanılacaktır.
zh_tw: 請指定這個系統的群組。這個選項控制了當它做為伺服器時，這個系統會出現在哪個群組裡、以及很多前端程式在瀏覽時所會使用的預設群組，以及 "security=domain" 這個設定所會用到的網域名稱。

source: Use password encryption?
eu: Zifraturiko pasahitzak erabili?
hu: Használsz kódolt jelszavakat?
ku: Bila kilîla şîfreyê bê bikaranîn?
lt: Naudoti slaptažodžių šifravimą?
tr: Parola şifrelemesi kullanılsın mı?
zh_tw: 是否使用加密密碼？

source: All recent Windows clients communicate with SMB/CIFS servers using encrypted passwords. If you want to use clear text passwords you will need to change a parameter in your Windows registry.
eu: Windows bezero berri guztiek SMB zerbitzariekiko harremanak zifraturiko pasahitzak erabiliaz egiten dituzte. Testu laueko pasahitzak erabili nahi izanez gero parametro bat aldatu behar duzu Windows erregistroan.
ku: Hemû navrûyên Windowsê dema şîfreyên kilîlkirî tên bikaranîn, bi pêşkêşkarên SMB/CIFS re dikevin têkiliyê. Eger dixwazî deqa şîfreya zelal bi kar bînî divê parametreya di tomarkirina Windowsa xwe de biguherînî.
tr: Yeni Windows istemcileri SMB/CIFS sunucularıyla şifrelenmiş parolalar kullanarak iletişim kurarlar. Eğer düz metin parolalar kullanmak istiyorsanız Windows kayıt defterinde bir parametreyi değiştirmeniz gerekecektir.
zh_tw: 所有較新的 Windows 用戶端在和 SMB/CIFS 伺服器通訊時都會使用加密密碼。如果您想使用明文密碼，您將需要修改您的 Windows 登錄表中的一個參數。

source: Enabling this option is highly recommended as support for plain text passwords is no longer maintained in Microsoft Windows products. If you do, make sure you have a valid /etc/samba/smbpasswd file and that you set passwords in there for each user using the smbpasswd command.
eu: Aukera hau gaitzea oso gomendagarri da testu laueko pasahitzen onarpena ez bait da aurrerantzean mantendurik egongo Microsoft produktuetan. Erabiltzea hautatuaz gero ziurtatu baliozko /etc/samba/smbpasswd fitxategi bat duzula eta pasahitzak smbpasswd programaren bidez ezarri dituzula.
ku: Çalakirina vê vebijêrkê wekî desteka ji bo şîfreyên deqa sade ya zêdetir nayên parastin ya di berhemên Microsoft Windowsê de, bi tundî tê pêşniyarkirin.
tr: Düz metin parola desteği artık Microsoft Windows ürünlerinde bulunmadığından bu seçeneği kullanmanız şiddetle önerilir. Eğer bu seçeneği kullanacaksanız, geçerli bir /etc/samba/smbpasswd dosyanız olduğundan emin olunuz ve smbpasswd komutunu kullanarak bütün kullanıcılar için parola belirleyiniz.
zh_tw: 強烈建議能啟用這個選項，因為 Microsoft Windows 系列產品對明文密碼的支援已沒有在維護了。如果您要啟用的話，請確認您有個有效的 /etc/samba/smbpasswd 檔，且其中包含了使用 smbpasswd 指令替每個使用者所設定的密碼。

source: Samba server
tr: Samba sunucusu

source: daemons
eu: deabruak
hu: démonok
ku: daemon
lt: tarnybos
tr: artalan süreçleri
zh_tw: 常駐程式

source: How do you want to run Samba?
eu: Nola nahi duzu Samba abiaraztea?
hu: Hogyan induljon a Samba?
ku: Dixwazî Samba çawa bixebitînî?
lt: Kokiu būdu norite leisti Samba?
tr: Samba'nın nasıl çalışmasını istersiniz?
zh_tw: 您想要如何執行 Samba？

source: The Samba daemon smbd can run as a normal daemon or from inetd. Running as a daemon is the recommended approach.
eu: Samba smbd zerbitzua deabru arrunt edo inted bidez abiarazi daiteke. Deabru bezala abiaraztea gomendatzen da.
hu: Az smbd Samba démon futhat normál démonként vagy az inetd-n keresztül. A démonként való futtatása a javasolt beállítás.
ku: Daemona Sambayê dikare wekî daemon'eke ji rêzê an jî inetd'ê bixebite. Xebitandina wekî daemonekê tê pêşniyarkirin.
lt: Samba tarnyba smbd gali veikti kaip įprastinė tarnyba arba ji gali būti paleidžiama iš inetd. Rekomenduojama Samba naudoti kaip įprastinę tarnybą.
tr: Samba artalan süreci smbd, normal bir artalan süreci olarak ya da inetd'den çalışabilir. Önerilen yaklaşım artalan süreci olarak çalıştırmaktır.
zh_tw: Samba 常駐程式 smbd 可以作為普通的常駐程式，或者是由 inetd 啟動。建議是以常駐程式的方式執行。
